Revit 2023 API
MassZone.FloorArea Property
 The floor area of the MassZone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public double FloorArea { get; }
Visual Basic
Public ReadOnly Property FloorArea As Double
	Get
Visual C++
public:
property double FloorArea {
	double get ();
}
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace